// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "扫描到计算机";

// Restore alert message
"RESTORE_TITLE" = "是否确实要还原设置?";
"RESTORE_MSG" = "如果继续，所有扫描快捷方式都会还原到其原始状态。按“取消”不更改快捷方式，按“还原”将快捷方式还原为其出厂默认设置。";
"RESTORE_BUTTON_TITLE" = "还原";

"DEFAULT_TASK_CAPTION" = "任务名称:";
"DONE" = "完成";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "任务不可用";
"TASK_NOT_FOUND_DESC" = "在您设备上发现的“%@”任务在系统上不可用。请选择其他任务。";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "工作流程复制失败";
"COPY_WORKFLOWS_DESC" = "无法将工作流程复制到用户设备域文件夹";

"DEVICE_NOT_FOUND_TITLE" = "未找到设备";
"DEVICE_NOT_FOUND_DESC" = "与设备通信时出现问题。请确保设备已接通电源且已正确连接，然后重试。";

"COMPUTER_NAME_INFO_TITLE" = "“计算机名称”字段用于输入要在 HP 设备上显示的计算机名称。"; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "可输入的字符数取决于您的设备。";

"UNKNOWN_ERROR_TITLE" = "未知错误";
"UNKNOWN_ERROR_DESC" = "更新设备时出现了未知错误。请确保设备已通电且连接正确。";

"OK" = "好";
"CANCEL" = "取消";

"MOREINFO_TITLE" = "更多信息";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "扫描快捷方式管理器"; // Title
"SSM_SHORT_DESC" = "使用扫描快捷方式即通过 HP 设备前面板上的控件执行常见扫描任务。"; // short description
"YOUR_COMPUTER_NAME" = "计算机名称:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "更改...";
"MORE_INFO_BTN_TITLE" = "更多信息...";
"RESTORE_BTN_TITLE" = "还原默认设置";
"TEST_BTN_TITLE" = "测试...";
"EDIT_BTN_TITLE" = "编辑...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "您对文件夹“%@”不具有适当的访问权限。要查看或更改访问权限，请在 Finder 中选择项目，然后选择“文件”>“显示简介”。"; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "错误";
"ERROR_UNKNOWN_DESC" = "发生未知错误。";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "找不到快捷方式";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "找不到设备 %2$@ 的快捷方式 %1$@。请尝试重新安装软件。";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "工作流创建失败";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "创建工作流时发生了未知错误。请重试。";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "创建目录时出错";
"ERROR_CREATING_DIR_DESC" = "创建目录 %@ 时出错。请检查父文件夹的访问权限，然后重试";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "在 Automator 中打开工作流程“%@”时发生错误。未在工作流程的原始位置找到该工作流程。";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "不支持扫描快捷键";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "由于软件未识别选定的扫描快捷键，所以该快捷键无法执行。请选择不同的扫描快捷键，然后重试。";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "单击以更改计算机名称";
"TIP_FOR_EDIT_BTN" = "编辑选定任务";
"TIP_FOR_TEST_BTN" = "运行选定任务";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "您的计算机名称为";
"COMPUTER_NAME_DESCRIPTION" = "从 HP 设备开始扫描时，系统可能会提示您从启用了“扫描到计算机”的主机计算机列表中选择计算机。";
"COMPUTER" = "计算机";
"COMPUTERS" = "计算机";


"COMMUNICATION_ERROR" = "无法建立扫描仪通信。 确保您的设备已开启，检查连接并确保您的网络正常运行。 请注意，必须在设备上启用 Bonjour。";
"INSTALLATION_ERROR" = "在此计算机上找不到扫描到计算机所需的 HP 软件。 请从 http://www.hp.com/support 下载并安装适用于您的设备的最新 HP 建议软件，然后重试。";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "无法启用“扫描到计算机”";
"SCAN_TO_COMPUTER_DESCRIPTION" = "通过“扫描到计算机”，您可以在 HP 设备的前面板处启动扫描，并自动将输出发送到计算机。";

HSDScanActionNotFoundTitle = "无法找到扫描操作";
HSDScanActionNotFoundDescription = "扫描操作尚未注册。请启动位于“%@”的 HP Scan 应用程序以自动注册扫描操作。";
